{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 161], "dtype": "float32", "sparse": false, "ragged": false, "name": "the_input"}, "name": "the_input", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "layer_1_conv", "trainable": true, "dtype": "float32", "filters": 200, "kernel_size": [11], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer_1_conv", "inbound_nodes": [[["the_input", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv_batch_norm", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv_batch_norm", "inbound_nodes": [[["layer_1_conv", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "layer_2_conv", "trainable": true, "dtype": "float32", "filters": 200, "kernel_size": [11], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer_2_conv", "inbound_nodes": [[["conv_batch_norm", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv_batch_norm_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv_batch_norm_2", "inbound_nodes": [[["layer_2_conv", 0, 0, {}]]]}, {"class_name": "GRU", "config": {"name": "rnn_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 250, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}, "name": "rnn_1", "inbound_nodes": [[["conv_batch_norm_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bt_rnn_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bt_rnn_1", "inbound_nodes": [[["rnn_1", 0, 0, {}]]]}, {"class_name": "GRU", "config": {"name": "final_layer_of_rnn", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 250, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}, "name": "final_layer_of_rnn", "inbound_nodes": [[["bt_rnn_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bt_rnn_final", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bt_rnn_final", "inbound_nodes": [[["final_layer_of_rnn", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 29, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "time_distributed", "inbound_nodes": [[["bt_rnn_final", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "ragged": false, "name": "input_length"}, "name": "input_length", "inbound_nodes": []}, {"class_name": "Activation", "config": {"name": "softmax", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "softmax", "inbound_nodes": [[["time_distributed", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "the_labels"}, "name": "the_labels", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAHAAAAEwAAAHMSAAAAdAB8AIgDiACIAogBZAGNBVMAKQJOKQHaC2Nv\nbnZfbGF5ZXJzKQHaEWNubl9vdXRwdXRfbGVuZ3RoKQHaAXipBNoQY29udl9ib3JkZXJfbW9kZXIB\nAAAA2gtjb252X3N0cmlkZdoLa2VybmVsX3NpemWpAPpNL2hvbWUvcmF2aS9HaXRoYXJzaGFsL2Rl\nZXBzcGVlY2gtMi10cmFpbmluZy9zcmMvdHJhaW4td2FsbWFydC9jcmVhdGVfbW9kZWwucHnaCDxs\nYW1iZGE+UwAAAHMMAAAAAgECAAIAAgACAAL/\n", null, ["same", 2, 2, 11]], "function_type": "lambda", "module": "create_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["input_length", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "ragged": false, "name": "label_length"}, "name": "label_length", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "ctc", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAUAAAAGAAAAQwAAAHMcAAAAfABcBH0BfQJ9A30EdACgAXwCfAF8A3wEoQRT\nAKkBTikC2gFL2g5jdGNfYmF0Y2hfY29zdCkF2gRhcmdz2gZ5X3ByZWTaBmxhYmVsc9oMaW5wdXRf\nbGVuZ3Ro2gxsYWJlbF9sZW5ndGipAHIJAAAA+kwvaG9tZS9yYXZpL0dpdGhhcnNoYWwvZGVlcHNw\nZWVjaC0yLXRyYWluaW5nL3NyYy90cmFpbi13YWxtYXJ0L3RyYWluX3V0aWxzLnB52g9jdGNfbGFt\nYmRhX2Z1bmMPAAAAcwQAAAAAAQwB\n", null, null], "function_type": "lambda", "module": "train_utils", "output_shape": [1], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "ctc", "inbound_nodes": [[["softmax", 0, 0, {}], ["the_labels", 0, 0, {}], ["lambda", 0, 0, {}], ["label_length", 0, 0, {}]]]}], "input_layers": [["the_input", 0, 0], ["the_labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "output_layers": [["ctc", 0, 0]]}}, "training_config": {"loss": {"ctc": "<lambda>"}, "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "SGD", "config": {"name": "SGD", "clipnorm": 5, "learning_rate": 0.009999999776482582, "decay": 9.999999747378752e-06, "momentum": 0.8999999761581421, "nesterov": true}}}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "bt_rnn_1/gamma", "shape": [250], "dtype": "float32"}, {"name": "bt_rnn_1/beta", "shape": [250], "dtype": "float32"}, {"name": "bt_rnn_1/moving_mean", "shape": [250], "dtype": "float32"}, {"name": "bt_rnn_1/moving_variance", "shape": [250], "dtype": "float32"}, {"name": "bt_rnn_final/gamma", "shape": [250], "dtype": "float32"}, {"name": "bt_rnn_final/beta", "shape": [250], "dtype": "float32"}, {"name": "bt_rnn_final/moving_mean", "shape": [250], "dtype": "float32"}, {"name": "bt_rnn_final/moving_variance", "shape": [250], "dtype": "float32"}, {"name": "conv_batch_norm/gamma", "shape": [200], "dtype": "float32"}, {"name": "conv_batch_norm/beta", "shape": [200], "dtype": "float32"}, {"name": "conv_batch_norm/moving_mean", "shape": [200], "dtype": "float32"}, {"name": "conv_batch_norm/moving_variance", "shape": [200], "dtype": "float32"}, {"name": "conv_batch_norm_2/gamma", "shape": [200], "dtype": "float32"}, {"name": "conv_batch_norm_2/beta", "shape": [200], "dtype": "float32"}, {"name": "conv_batch_norm_2/moving_mean", "shape": [200], "dtype": "float32"}, {"name": "conv_batch_norm_2/moving_variance", "shape": [200], "dtype": "float32"}, {"name": "final_layer_of_rnn/gru_cell_1/kernel", "shape": [250, 750], "dtype": "float32"}, {"name": "final_layer_of_rnn/gru_cell_1/recurrent_kernel", "shape": [250, 750], "dtype": "float32"}, {"name": "final_layer_of_rnn/gru_cell_1/bias", "shape": [2, 750], "dtype": "float32"}, {"name": "layer_1_conv/kernel", "shape": [11, 161, 200], "dtype": "float32"}, {"name": "layer_1_conv/bias", "shape": [200], "dtype": "float32"}, {"name": "layer_2_conv/kernel", "shape": [11, 200, 200], "dtype": "float32"}, {"name": "layer_2_conv/bias", "shape": [200], "dtype": "float32"}, {"name": "rnn_1/gru_cell/kernel", "shape": [200, 750], "dtype": "float32"}, {"name": "rnn_1/gru_cell/recurrent_kernel", "shape": [250, 750], "dtype": "float32"}, {"name": "rnn_1/gru_cell/bias", "shape": [2, 750], "dtype": "float32"}, {"name": "time_distributed/kernel", "shape": [250, 29], "dtype": "float32"}, {"name": "time_distributed/bias", "shape": [29], "dtype": "float32"}]}]}